#Область БИБЛИОТЕКА_ФУНКЦИЙ

#Область ОТЛАДКА

#Конецобласти

#Область ИНТЕРАКТИВ

// Открывает диалог выбора файла и передаёт выполнение в заданную процедуру
// Параметры:
//  ИмяПроцедуры  - Строка - Имя метода (процедуры) продолжения после выбора
//  ВызывающаяФорма  - ФормаКлиентскогоПриложения/Форма - Форма, из которой будет вызван обработчик оповещения
//			с параметрами ВыбранныеФайлы (массив полных имён выбранных файлов/Неопределено) и ДополнительныеПараметры (см.ПараметрыПродолжения)
//  ПараметрыПродолжения  - Произвольный (обычно структура) - Второй параметр метода продолжения
//  Фильтр  - Строка - Фильтр в формате "Описание расширения (*.Расширение)|*.Расширение|...". По умолчанию xlsx.
//  ИндексФильтра  - Число - Индекс главного фильтра в строке фильтров. По умолчанию 0.
//  МножественныйВыбор  - Булево - Возможность выбрать несколько файлов
//  Заголовок  - Строка - Заголовок диалога. Если не указан - сформируется автоматически.
//  Режим  - РежимДиалогаВыбораФайла - Режим диалога. По умолчанию Открытие.
//  Каталог  - Строка - Каталог, в котором откроется диалог
//  ПолноеИмяФайла  - Строка - Полное имя файла по умолчанию. Если не указано - сгенерирует ДляЗагрузки.
//  ПроверятьСуществованиеФайла  - Булево - Параметр диалога. По умолчанию ЛОЖЬ
//  ПредварительныйПросмотр  - Булево - Параметр диалога. По умолчанию ЛОЖЬ
//  Расширение  - Строка - Расширение файла. Если не указано - сформируется по главному фильтру.
&НаКлиенте
Процедура ВыбратьФайлИПродолжить(ИмяПроцедуры,
	    ВызывающаяФорма,
		ПараметрыПродолжения = Неопределено,
		Фильтр = "#АВТО",
		ИндексФильтра = 0,
		МножественныйВыбор = Истина,
		Заголовок = "#АВТО",
		Режим = Неопределено,
		Каталог = "#АВТО",
		ПолноеИмяФайла = "#АВТО",
		ПроверятьСуществованиеФайла = Ложь,
		ПредварительныйПросмотр = Ложь,
		Расширение = "#АВТО") Экспорт
	#Если ТонкийКлиент ИЛИ ВебКлиент ИЛИ ТолстыйКлиентУправляемоеПриложение ИЛИ ТолстыйКлиентОбычноеПриложение Тогда
		#Область ИНИЦИАЛИЗАЦИЯ_ПАРАМЕТРОВ_ПО_УМОЛЧАНИЮ
			Если Режим = Неопределено Тогда
				Режим = РежимДиалогаВыбораФайла.Открытие;
			КонецЕсли;
			Если ПараметрыПродолжения = Неопределено Тогда
				ПараметрыПродолжения = Новый Структура;
			КонецЕсли;
			Если Фильтр = "#АВТО" Тогда
				Фильтр = НСтр("ru = 'Книга Excel|*.xlsx'");
			КонецЕсли;
			Если Расширение = "#АВТО" Тогда
				Расширение = СтрПолучитьСтроку(
						СтрЗаменить(
							СтрПолучитьСтроку(
								СтрЗаменить(Фильтр, "|", Символы.ПС),
								2 * ИндексФильтра + 1),
							".",
							Символы.ПС),
						2);
			КонецЕсли;
			Если Заголовок = "#АВТО" Тогда
				Заголовок = ?(Режим = РежимДиалогаВыбораФайла.Сохранение,
						НСтр("ru = 'Выбор пути сохранения'"),
						?(Режим = РежимДиалогаВыбораФайла.ВыборКаталога,
						НСтр("ru = 'Выбор каталога'"),
						НСтр("ru = 'Выбор открываемых файлов'")));
			КонецЕсли;
			Если Каталог = "#АВТО" Тогда
				Каталог = КаталогДокументов();
			КонецЕсли;
			Если ПолноеИмяФайла = "#АВТО" Тогда
				ПолноеИмяФайла = Каталог + "ДляЗагрузки." + Расширение;
			КонецЕсли;
		#КонецОбласти
		#Область ИНИЦИАЛИЗАЦИЯ_ДИАЛОГА
			ДВФ = Новый ДиалогВыбораФайла(Режим);
			ДВФ.Заголовок = Заголовок;
			ДВФ.ИндексФильтра = ИндексФильтра;
			ДВФ.Каталог = Каталог;
			ДВФ.МножественныйВыбор = МножественныйВыбор;
			ДВФ.ПолноеИмяФайла = ПолноеИмяФайла;
			ДВФ.ПредварительныйПросмотр = ПредварительныйПросмотр;
			ДВФ.ПроверятьСуществованиеФайла = ПроверятьСуществованиеФайла;
			ДВФ.Расширение = Расширение;
			ДВФ.Фильтр = Фильтр;
		#КонецОбласти
	#КонецЕсли
	ДВФ.Показать(Новый ОписаниеОповещения(ИмяПроцедуры, ВызывающаяФорма, ПараметрыПродолжения));
КонецПроцедуры // ВыбратьФайлИПродолжить

// Предлагает выбрать реквизит заданного объекта и возвращает его имя
// Параметры:
//  ЧейРеквизит  - Произвольный - Объект, реквизит которого будет предложен к выбору
// Возвращаемое значение:
//   Строка   - Имя ТЧ и реквизита, например "Банк" или "Товары.Количество"
Функция ИмяВыбранногоРеквизита(ЧейРеквизит) Экспорт
	Результат = "НЕ ГОТОВО";
	//Реализовать одним из двух вариантов:
	//А) открыть дерево МД в нужной ветке
	//Б) прочитать МД со значениями (для ТЧ и ТЗ - первой строки)
	//Также должны отрабатываться ситуации для таблицы значений, массива, списка значений, структуры и их фиксиков.
	Возврат Результат
КонецФункции // ИмяВыбранногоРеквизита()
 
// Возвращает ответ, данный пользователем несколько раз (для предотвращения случайных опаснх действий)
//
// Параметры:
//  Кнопки  - РежимДиалогаВопрос; СписокЗначений - параметр функции Вопрос, по умолчанию РежимДиалогаВопрос.ДаНет
//  КоличествоПовторов  - Число - Количество попыток (сколько раз спросить)
//  ТекстВопроса  -  Строка; ФорматированнаяСтрока - параметр функции Вопрос
//  ТаймАут  - Число - параметр функции Вопрос
//  КнопкаПоУмолчанию  - Произвольный - параметр функции Вопрос
//  Заголовок  - Строка; ФорматированнаяСтрока - параметр функции Вопрос
//  КнопкаТаймАута  - Произвольный - параметр функции Вопрос
//
// Возвращаемое значение:
//   Произвольный   - Если пользователь назвал во всех попытках одно значение - то оно, если нет - неопределено
//
Функция СпроситьТрижды(Кнопки = Неопределено, КоличествоПовторов = 3, ТекстВопроса = "", ТаймАут = 0, КнопкаПоУмолчанию = Неопределено, Заголовок = "Хитрый вопрос", КнопкаТаймАута = Неопределено) Экспорт
	Если Кнопки = Неопределено Тогда
		Кнопки = РежимДиалогаВопрос.ДаНет;
	КонецЕсли;
	Результат = Неопределено;
	Для Ё = 1 По КоличествоПовторов Цикл
		Если ТипЗнч(Кнопки) = Тип("СписокЗначений") Тогда
			ВОЛНА_ОбщегоНазначения_КлиентСервер.ПеремешатьСписок(Кнопки);	
		КонецЕсли; 
		Промежуточный = Вопрос(ТекстВопроса, Кнопки, ТаймАут, КнопкаПоУмолчанию, Заголовок, КнопкаТаймАута);
		Если Результат = Неопределено Тогда
			Результат = Промежуточный;
		ИначеЕсли Результат <> Промежуточный Тогда
			Результат = Неопределено;
			Прервать;
		КонецЕсли; 
	КонецЦикла;
	Возврат Результат;
КонецФункции // СпроситьТрижды()

#КонецОбласти 

#Область СТРОКОВЫЕ
 
//Возвращает сочетание клавиш по строковому обозначению
//Параметры:
//	СтроковоеОбозначениеСочетания - Строка - Расшифровываемое сочетание
//Возвращаемое значение
//	СочетаниеКлавиш - распознанное сочетание или Неопределено
Функция СочетаниеКлавишПоСтроке(СтроковоеОбозначениеСочетания) Экспорт
	Результат = Неопределено;
	Ктрл = Ложь;
	Шифт = Ложь;
	Алт = Ложь;
	Код = СтрЗаменить(СтроковоеОбозначениеСочетания, " ", "");
	
	ТекТекст = "Ctrl+";
	Поз = Найти(Код, ТекТекст);
	Если Поз > 0 Тогда
		Ктрл = Истина;
		Код = СтрЗаменить(Код, ТекТекст, "");
	КонецЕсли; 
	
	ТекТекст = "Shift+";
	Поз = Найти(Код, ТекТекст);
	Если Поз > 0 Тогда
		Шифт = Истина;
		Код = СтрЗаменить(Код, ТекТекст, "");
	КонецЕсли; 
	
	ТекТекст = "Alt+";
	Поз = Найти(Код, ТекТекст);
	Если Поз > 0 Тогда
		Алт = Истина;
		Код = СтрЗаменить(Код, ТекТекст, "");
	КонецЕсли;
	
	Попытка
		Клав = Клавиша[Код];
	Исключение
		Клав = "";
	КонецПопытки;
	
	Если Клав <> "" Тогда
		Результат = Новый СочетаниеКлавиш(Клав, Алт, Ктрл, Шифт);
	КонецЕсли; 
	
КонецФункции // СочетаниеКлавишПоСтроке()

#КонецОбласти

#КонецОбласти

