Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Для каждого СтрокаТЧ Из Состав Цикл
		Если ЗначениеЗаполнено(СтрокаТЧ.Время) И ЗначениеЗаполнено(СтрокаТЧ.Статья) Тогда
			НоваяЗапись = Движения.Деньги.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, СтрокаТЧ);
			НоваяЗапись.Кошелёк = Кошелёк;
			НоваяЗапись.Период = СтрокаТЧ.Время;
			НоваяЗапись.Поступление = СтрокаТЧ.Сумма;
			НоваяЗапись.Приход = СтрокаТЧ.Сумма >= 0;
			//НоваяЗапись.НомерСтроки = СтрокаТЧ.НомерСтроки;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

